//abc093_a.m
####################################
####################################
####################################
####################################
####################################
####################################
disp("YNeos"((prod(scanf("%s"))!=941094)+1:2:5))

scanf("%s") は、ユーザーからの入力を受け取ります。入力された文字列は s に格納されます。
prod(scanf("%s")) は、入力された文字列を文字コードとして扱い、その積を計算します。
(prod(scanf("%s"))!=941094) は、上記の積が 941094 と等しくない場合に真を返します。
####################################
s = fgetl(0);
if size(unique(s))(2) == 3
    disp("Yes")
else
    disp("No")
endif
####################################
S=input('','s');
A=index(S,"a");
B=index(S,"b");
C=index(S,"c");
if (A*B*C==0)
  printf("%s","No")
else
  printf("%s","Yes")
endif
####################################
S = input('', 's');
if (any(strfind(S, 'a')) && any(strfind(S, 'b')) && any(strfind(S, 'c'))) 
    disp("Yes");
else
    disp("No");
end
####################################
